---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.AreaReinforcementCurve
source: html/b9ddfd61-f47e-0a01-4398-b1179d53ef12.htm
---
# AreaReinforcementCurve Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.